uhnp/src/InformationRegisters/ВалютыОтчетности/ВалютыОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВалютыОтчетности</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <attributes>
    <name>ОсновнаяВалюта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регламент</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонДокументаБД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументБД</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьВидОтчета</name>
    <comment>используется ШаблонДокументаБД</comment>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ХранилищаПараметрическойНастройкиРасширенный/ХранилищаПараметрическойНастройкиРасширенный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХранилищаПараметрическойНастройкиРасширенный</name>
  <resources>
    <name>ДанныеПараметрическойНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ИсточникПараметрическойНастройки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПараметрическойНастройки</name>
    <type>
      <types>EnumRef.ТипПараметрическойНастройки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Documents/УправлениеПериодомСценария/УправлениеПериодомСценария.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УправлениеПериодомСценария</name>
  <posting>Deny</posting>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяПериодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСценария</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСценарияОкончание</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияОрганизационнойСтруктуры</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроцесса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьЛимиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСкользящегоПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаАктуализации</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийГоризонт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРасширеннаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗапускатьПроцесс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭкземплярПроцесса</name>
    <type>
      <types>DocumentRef.ЭкземплярПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаНачалаСверкиВГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаОкончанияСверкиВГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПервоеПрименение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыОтчетовДляУстановкиЛимитов</name>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>CatalogRef.ВидыОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПериодическиеКурсы</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКурсЗаПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКурсЗаПериодМСФО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсНаНачалоПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсНаКонецПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКурсЗаПредыдущийПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсНаКонецПредыдущегоПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Catalogs/ВидыОтчетов/ВидыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОтчетов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидАналитики1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики6</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоАналитик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктуальныйШаблон</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрБухгалтерии</name>
    <type>
      <types>CatalogRef.РегистрыБухгалтерииБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьЗабалансовыеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФормироватьАналитическиеРаскрытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыводитьГруппирующиеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СокращеннаяОСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучатьБухгалтерскиеИтогиПоГруппирующимСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРакурсы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникБД</name>
    <type>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПоСтруктуреСправочника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожетИспользоватьсяДляУстановкиЛимитов</name>
    <comment>ОПК</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистраИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектДляСогласованияЗначений</name>
    <type>
      <types>EnumRef.ОбъектыСогласованияЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоВыбраннымСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаФормированияФормул</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулыДляНачальныхСальдо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОтчета</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВидыИтоговПоСчетам</name>
    <attributes>
      <name>ВидИтогаПоСчету</name>
      <type>
        <types>EnumRef.ВидыБухгалтерскихИтогов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыУстановкиЛимитов</name>
    <comment>ОПК</comment>
    <attributes>
      <name>КолонкаОтчета</name>
      <comment>ОПК</comment>
      <type>
        <types>CatalogRef.КолонкиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Предназначение</name>
      <comment>ОПК</comment>
      <type>
        <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеСчета</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетИспользуется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/CommonModules/БюджетированиеИОтчетностьПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает данные вида отчета
//
// Параметры:
//  ВидОтчета	 - СправочникСсылка.ВидыОтчетов - Ссылка на вид отчета
// 
// Возвращаемое значение:
//   - Структура - Структура с данными вида отчета
//
Функция ДанныеВидаОтчета(ВидОтчета) Экспорт
	
	ДанныеВидаОтчета = Новый Структура;
	ДанныеВидаОтчета.Вставить("ВидОтчета", Справочники.ВидыОтчетов.ПустаяСсылка());
	ДанныеВидаОтчета.Вставить("РазделениеПоПроектам", Ложь);
	ДанныеВидаОтчета.Вставить("СохранятьИсториюИзменений", Ложь);
	ДанныеВидаОтчета.Вставить("МаксКлючевыхАналитик", 0);
	Для Сч = 1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
		ДанныеВидаОтчета.Вставить("ВидАналитики" + Сч, Неопределено);
		ДанныеВидаОтчета.Вставить("ТипЗначенияАналитики" + Сч, Неопределено);
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ВидОтчета) Тогда
		Возврат ДанныеВидаОтчета;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыОтчетов.Ссылка КАК ВидОтчета,
		|	ВидыОтчетов.РазделениеПоПроектам КАК РазделениеПоПроектам,
		|	ВидыОтчетов.СохранятьИсториюИзменений КАК СохранятьИсториюИзменений,
		|	ВидыОтчетов.КоличествоАналитик КАК МаксКлючевыхАналитик,
		|	ВидыОтчетов.ВидАналитики1 КАК ВидАналитики1,
		|	ВидыОтчетов.ВидАналитики2 КАК ВидАналитики2,
		|	ВидыОтчетов.ВидАналитики3 КАК ВидАналитики3,
		|	ВидыОтчетов.ВидАналитики4 КАК ВидАналитики4,
		|	ВидыОтчетов.ВидАналитики5 КАК ВидАналитики5,
		|	ВидыОтчетов.ВидАналитики6 КАК ВидАналитики6,
		|	ВидыОтчетов.ВидАналитики1.ТипЗначения КАК ТипЗначенияАналитики1,
		|	ВидыОтчетов.ВидАналитики2.ТипЗначения КАК ТипЗначенияАналитики2,
		|	ВидыОтчетов.ВидАналитики3.ТипЗначения КАК ТипЗначенияАналитики3,
		|	ВидыОтчетов.ВидАналитики4.ТипЗначения КАК ТипЗначенияАналитики4,
		|	ВидыОтчетов.ВидАналитики5.ТипЗначения КАК ТипЗначенияАналитики5,
		|	ВидыОтчетов.ВидАналитики6.ТипЗначения КАК ТипЗначенияАналитики6
		|ИЗ
		|	Справочник.ВидыОтчетов КАК ВидыОтчетов
		|ГДЕ
		|	ВидыОтчетов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВидОтчета);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеВидаОтчета, Выборка);
	КонецЕсли;
	
	Возврат ДанныеВидаОтчета;

КонецФункции

// Возращает документ УправлениеПериодомСценария по входным данным
//
// Параметры:
//  Сценарий - СправочникСсылка.Сценарии - Сценарий
//  Период	 - СправочникСсылка.Периоды - Период
// 
// Возвращаемое значение:
//   - Структура - Структура с данными
//
Функция НайтиУправлениеПериодомСценария(Сценарий, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументУправлениеПериодомСценария.Ссылка КАК УправлениеПериодом
		|ИЗ
		|	Документ.УправлениеПериодомСценария КАК ДокументУправлениеПериодомСценария
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Периоды КАК ПериодыСценарияНачало
		|		ПО ДокументУправлениеПериодомСценария.ПериодСценария = ПериодыСценарияНачало.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Периоды КАК ПериодыСценарияОкончание
		|		ПО ДокументУправлениеПериодомСценария.ПериодСценарияОкончание = ПериодыСценарияОкончание.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Периоды КАК Периоды
		|		ПО (ПериодыСценарияНачало.Периодичность = Периоды.Периодичность)
		|			И (ПериодыСценарияНачало.ДатаНачала <= Периоды.ДатаНачала)
		|			И (ПериодыСценарияОкончание.ДатаОкончания >= Периоды.ДатаОкончания)
		|ГДЕ
		|	ДокументУправлениеПериодомСценария.Сценарий = &Сценарий
		|	И Периоды.Ссылка = &Период";
			
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		УправлениеПериодом = Выборка.УправлениеПериодом;
	Иначе
		УправлениеПериодом = Неопределено;
	КонецЕсли;
	
	Возврат ДанныеУправленияПериодомСценария(УправлениеПериодом);
	
КонецФункции

// Возвращает данные управления периодом сценария
//
// Параметры:
//  УправлениеПериодом	 - ДокументСсылка.УправлениеПериодомСценария - Документ для которого собираются данные
// 
// Возвращаемое значение:
//   - Структура - Структура с данными
//
Функция ДанныеУправленияПериодомСценария(УправлениеПериодом) Экспорт
	
	СтруктураДанных = Новый Структура("УправлениеПериодом, ПериодЗакрыт, Сценарий, Периодичность, ПериодСценария, 
		|ДатаНачала, ПериодСценарияОкончание, ДатаОкончания,
		|ВерсияРегламента, ГруппаВидовОтчетов, ПересчитыватьЗависимыеПоказатели, 
		|ЗаполнятьПустыеАналитики, ШаблонПроцесса, ЗапрещатьДокументыВнеПроцесса");
	
	Если НЕ ЗначениеЗаполнено(УправлениеПериодом) Тогда
		Возврат СтруктураДанных;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументУправлениеПериодомСценария.Ссылка КАК УправлениеПериодом,
		|	ДокументУправлениеПериодомСценария.ПериодЗакрыт КАК ПериодЗакрыт,
		|	ДокументУправлениеПериодомСценария.Сценарий КАК Сценарий,
		|	ПериодыСценарияНачало.Периодичность КАК Периодичность,
		|	ПериодыСценарияНачало.Ссылка КАК ПериодСценария,
		|	ПериодыСценарияНачало.ДатаНачала КАК ДатаНачала,
		|	ПериодыСценарияОкончание.Ссылка КАК ПериодСценарияОкончание,
		|	ПериодыСценарияОкончание.ДатаОкончания КАК ДатаОкончания,
		|	ВерсииРегламентовПодготовкиОтчетности.Ссылка КАК ВерсияРегламента,
		|	ВерсииРегламентовПодготовкиОтчетности.ВидОтчета КАК ГруппаВидовОтчетов,
		|	ВерсииРегламентовПодготовкиОтчетности.АвтоматическиПересчитыватьЗависимыеПоказатели КАК ПересчитыватьЗависимыеПоказатели,
		|	ВерсииРегламентовПодготовкиОтчетности.ПодставлятьЗначенияАналитикПоУмолчанию КАК ЗаполнятьПустыеАналитики,
		|	ВерсииРегламентовПодготовкиОтчетности.ШаблонПроцесса КАК ШаблонПроцесса,
		|	ВерсииРегламентовПодготовкиОтчетности.ЗапрещатьДокументыВнеПроцесса КАК ЗапрещатьДокументыВнеПроцесса
		|ИЗ
		|	Документ.УправлениеПериодомСценария КАК ДокументУправлениеПериодомСценария
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Периоды КАК ПериодыСценарияНачало
		|		ПО ДокументУправлениеПериодомСценария.ПериодСценария = ПериодыСценарияНачало.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Периоды КАК ПериодыСценарияОкончание
		|		ПО ДокументУправлениеПериодомСценария.ПериодСценарияОкончание = ПериодыСценарияОкончание.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВерсииРегламентовПодготовкиОтчетности КАК ВерсииРегламентовПодготовкиОтчетности
		|		ПО ДокументУправлениеПериодомСценария.ВерсияОрганизационнойСтруктуры = ВерсииРегламентовПодготовкиОтчетности.Ссылка
		|ГДЕ
		|	ДокументУправлениеПериодомСценария.Ссылка = &УправлениеПериодом";
			
	Запрос.УстановитьПараметр("УправлениеПериодом", УправлениеПериодом);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

// Возвращает таблицу с настройкам валют отчетности
//
// Параметры:
//  УправлениеПериодом	 - ДокументСсылка.УправлениеПериодомСценария - Управление периодом
//  Организация			 - СправочникСсылка.Организации - Организация
//  ВидОтчета			 - СправочникСсылка.ВидыОтчетов - Вид отчета
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица с настройками валют отчетности
//
Функция ВалютыОтчетности(УправлениеПериодом, Организация, ВидОтчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВалютыОтчетностиСрезПоследних.ОсновнаяВалюта КАК ОсновнаяВалюта,
		|	ВалютыОтчетностиСрезПоследних.Валюта КАК Валюта,
		|	ВалютыОтчетностиСрезПоследних.Валюта.Представление КАК ВалютаПредставление
		|ИЗ
		|	РегистрСведений.ВалютыОтчетности.СрезПоследних(
		|			,
		|			Регламент В
		|					(ВЫБРАТЬ
		|						УправлениеПериодомСценария.ВерсияОрганизационнойСтруктуры КАК ВерсияОрганизационнойСтруктуры
		|					ИЗ
		|						Документ.УправлениеПериодомСценария КАК УправлениеПериодомСценария
		|					ГДЕ
		|						УправлениеПериодомСценария.Ссылка = &УправлениеПериодом)
		|				И (ШаблонДокументаБД = &ШаблонДокументаБД
		|					ИЛИ ШаблонДокументаБД = НЕОПРЕДЕЛЕНО)
		|				И Организация = &Организация
		|				И Валюта <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ВалютыОтчетностиСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОсновнаяВалюта УБЫВ,
		|	ВалютыОтчетностиСрезПоследних.Валюта.Код";
	
	Запрос.УстановитьПараметр("УправлениеПериодом",	УправлениеПериодом);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ШаблонДокументаБД",	ВидОтчета);
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Данные документа по справочнику "ДокументыБД"
//
// Параметры:
//  ИмяОбъектаМетаданного	 - Строка - Имя документа метаданных
// 
// Возвращаемое значение:
//   - Структура - Структура с данными документа
//
Функция ДанныеДокументаБД(ИмяОбъектаМетаданного) Экспорт

	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Ссылка", Неопределено);
	СтруктураДанных.Вставить("ИспользуетсяВПроцессе", Ложь);
	СтруктураДанных.Вставить("ИспользоватьШаблоны", Ложь);
	СтруктураДанных.Вставить("РеквизитШаблонаДокумента", "");
	СтруктураДанных.Вставить("РеквизитРазделенияПоОрганизациям", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументыБД.Ссылка КАК Ссылка,
		|	ДокументыБД.ИспользуетсяВПроцессе КАК ИспользуетсяВПроцессе,
		|	ДокументыБД.ИспользоватьШаблоны КАК ИспользоватьШаблоны,
		|	ДокументыБД.РеквизитШаблонаДокумента КАК РеквизитШаблонаДокумента,
		|	ДокументыБД.РеквизитРазделенияПоОрганизациям КАК РеквизитРазделенияПоОрганизациям,
		|	ДокументыБД.Согласуется КАК Согласуется
		|ИЗ
		|	Справочник.ДокументыБД КАК ДокументыБД
		|ГДЕ
		|	ДокументыБД.Наименование = &ИмяОбъектаМетаданного";
	
	Запрос.УстановитьПараметр("ИмяОбъектаМетаданного", ИмяОбъектаМетаданного);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
	КонецЦикла;
	
	Возврат СтруктураДанных;
	
КонецФункции

// Получает данные параметрической настройки расширенный
//
// Параметры:
//  ИсточникПараметрическойНастройки - СправочникСсылка.ПравилаОбработки - Правило обработки по 
//		которому построена параметрическая настройка
//  ТипПараметрическойНастройки		 - ПеречислениеСсылка.ТипПараметрическойНастройки - Тип настройки
//  ДатаАктуальности				 - Дата - Дата актуальности параметрической настройки
// 
// Возвращаемое значение:
//  Структура - Параметрическая настройка для расчета показателей
//
Функция ПолучитьДанныеПараметрическойНастройкиРасширенный(ИсточникПараметрическойНастройки, ТипПараметрическойНастройки, ДатаАктуальности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХранилищаПараметрическойНастройкиРасширенный.ДанныеПараметрическойНастройки
		|ИЗ
		|	РегистрСведений.ХранилищаПараметрическойНастройкиРасширенный КАК ХранилищаПараметрическойНастройкиРасширенный
		|ГДЕ
		|	ХранилищаПараметрическойНастройкиРасширенный.ИсточникПараметрическойНастройки = &ИсточникПараметрическойНастройки
		|	И ХранилищаПараметрическойНастройкиРасширенный.ТипПараметрическойНастройки = &ТипПараметрическойНастройки";
	
	Запрос.УстановитьПараметр("ИсточникПараметрическойНастройки", ИсточникПараметрическойНастройки);
	Запрос.УстановитьПараметр("ТипПараметрическойНастройки", ТипПараметрическойНастройки);
	
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	Возврат Результат.ДанныеПараметрическойНастройки.Получить();
	
КонецФункции

#КонецОбласти
